{"config": [{"config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "kernel_constraint": null, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_constraint": null, "return_state": false, "use_bias": true, "batch_input_shape": [null, 1, 1], "activity_regularizer": null, "unroll": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "unit_forget_bias": true, "stateful": false, "recurrent_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 4, "name": "lstm_1", "trainable": true}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 3, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow"}